Description: Packages the current version of Lucid. MK 2025 03 22
Identifier: com.github.markkenny.autopkg.pkg.lucid
ParentRecipe: com.github.markkenny.autopkg.download.lucid

MinimumVersion: "2.3"

Input:
  NAME: Lucid

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/downloads/unpack'
    flat_pkg_path: '%pathname%'

- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/downloads/unpack/Lucid.pkg'

- Processor: com.github.nmcspadden.shared/PackageInfoVersioner
  Arguments:
    package_info_path: '%found_filename%/PackageInfo'

- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
    source_pkg: '%pathname%'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/downloads/unpack'
