Description: Packages the current version of Lucid. MK 2025 03 22
Identifier: com.github.markkenny.autopkg.pkg.lucid
ParentRecipe: com.github.markkenny.autopkg.download.lucid

MinimumVersion: "2.3"

Input:
  NAME: Lucid
  DOWNLOAD_URL: https://www.lucidlink.com/download/latest/osx/stable/

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      flat_pkg_path: "%pathname%"
  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/Lucid.pkg/Payload"
  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/unpack/Lucid.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      source_pkg: "%pathname%"