Description: Downloads the current version of LucidLink. MK 2025 02 25 - New download link - The kextless application!!!
Identifier: com.github.markkenny.autopkg.download.lucidlink
MinimumVersion: "2.3"

Input:
  NAME: LucidLink

Process:
- Processor: URLDownloader
  Arguments:
    url: "https://www.lucidlink.com/download/new-ll-latest/macos/stable/"
    filename: '%NAME%.pkg'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: "%pathname%"
    expected_authority_names:
      - "Developer ID Installer: LucidLink Corp. (Y4KMJPU2B4)"
      - "Developer ID Certification Authority"
      - "Apple Root CA"
