Description: Downloads the current version of LucidLink. MK 2024 11 08 - The kextless application!!!

Identifier: com.github.markkenny.autopkg.download.lucidlink
MinimumVersion: "2.3"

Input:
  NAME: LucidLink
  SEARCH_URL: https://www.lucidlink.com/download
  SEARCH_PATTERN: lucidlink-[0-9\.]*.pkg
  DOWNLOAD_URL: https://releases.lucidlink.com/prod/macos

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: "%SEARCH_PATTERN%"
      url: "%SEARCH_URL%"

  - Processor: URLDownloader
    Arguments:
      url: "%DOWNLOAD_URL%/%match%"
      filename: "%NAME%.pkg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%"
      expected_authority_names:
        - "Developer ID Installer: LucidLink Corp. (Y4KMJPU2B4)"
        - Developer ID Certification Authority
        - Apple Root CA
