Description: Packages the current version of LucidLink. The new KEXTLESS version!!!
Identifier: com.github.markkenny.autopkg.pkg.lucidlink
ParentRecipe: com.github.markkenny.autopkg.download.lucidlink

MinimumVersion: "2.3"

Input:
  NAME: LucidLink

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      flat_pkg_path: "%pathname%"
  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/LucidLink.pkg/Payload"
  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/unpack/LucidLink.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      source_pkg: "%pathname%"