Description: Packges the latest download of 4K Video Downloader Plus
Identifier: com.github.markkenny.autopkg.pkg.4kvideodownloaderplus
ParentRecipe: com.github.markkenny.autopkg.download.4kvideodownloaderplus
MinimumVersion: "2.3"

Input:
  NAME: 4K Video Downloader Plus

Process:
- Processor: AppPkgCreator
