Description: Downloads the latest version of Rainbow and creates a package.
Identifier: com.github.markkenny.autopkg.pkg.rainbow
ParentRecipe: com.github.markkenny.autopkg.download.Rainbow
MinimumVersion: "2.3"

Input:
  NAME: Rainbow
  VENDOR: Rainbow

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%pathname%/Rainbow.app'
    pkg_path: '%RECIPE_CACHE_DIR%/%VENDOR%_%version%.pkg'
