Description: Packages the latest download of Autodesk RV
Identifier: com.github.markkenny.autopkg.pkg.autodesk-rv
ParentRecipe: com.github.markkenny.autopkg.download.autodesk-rv

MinimumVersion: "2.3"

Input:
  NAME: Autodesk RV

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: "%pathname%/RV.app"
    pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"

