Description: Download the latest release of Autodesk RV
Identifier: com.github.markkenny.autopkg.download.autodesk-rv
MinimumVersion: "2.3"

Input:
  NAME: Autodesk RV

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: "https://sg-software.ems.autodesk.com/deploy/rv/Current_Release/MacOS-release.dmg"

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: "%pathname%/RV.app"
    requirement: identifier "com.tweaksoftware.RV" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "XXKJ396S2Y"
