Description: Downloads the current release of Adobe Workfront Proof
Identifier: com.github.markkenny.autopkg.download.adobe-workfront-proof
MinimumVersion: "2.3"

Input:
  NAME: Workfront Proof
  SEARCH_URL: https://experienceleague.adobe.com/docs/workfront/using/review-and-approve-work/proofing/use-the-desktop-proofing-viewer/installing-desktop-proofing-viewer.html?lang=en
  SEARCH_PATTERN: (https://assets\.proofhq\.com/nativeviewer/desktop_viewer/Workfront\+Proof-.*?\.pkg)
  USER_AGENT: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10

Process:

- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%SEARCH_PATTERN%'
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.pkg'
    url: '%match%'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Adobe Inc. (JQ525L2MZD)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'
