Description: Downloads the current release of Adobe Workfront Proof
Identifier: com.github.markkenny.autopkg.download.adobe-workfront-proof

MinimumVersion: "2.3"

Input:
  NAME: Workfront Proof
  DOWNLOAD_URL: https://app.proofhq.com/desktopviewer/mac
  USER_AGENT: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/18.0 Safari/605.1.15

Process:

- Processor: URLDownloader
  Arguments:
    curl_opts:
      - --location
    filename: '%NAME%.pkg'
    request_headers:
      user-agent: '%USER_AGENT%'
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Adobe Inc. (JQ525L2MZD)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'
