Description: Download the latest release of the OpenWebStart installer from GitHub. Taken from NStraus and added platform
Identifier: com.github.markkenny.autopkg.download.OpenWebStart
MinimumVersion: "2.3"

Input:
  NAME: OpenWebStart

Process:
- Processor: DeprecationWarning
  Arguments:
    warning_message: Consider switching to the OpenWebStart recipes in the nstrauss-recipes repo. This recipe is deprecated and will be removed in the future.

- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: ^.*(macos-%ARCH%).*$
    github_repo: karakun/OpenWebStart

- Processor: URLDownloader
  Arguments:
    filename: OpenWebStart-%ARCH%-%version%.dmg

- Processor: EndOfCheckPhase
