Description: Downloads the latest version of Connect Fonts
Identifier: com.github.markkenny.autopkg.download.Connectfonts
MinimumVersion: "2.3"

Input:
  NAME: Connect Fonts

Process:
- Processor: SparkleUpdateInfoProvider
  Arguments:
    appcast_url: https://sparkle.extensis.com/u/ST/EN/suitcase26en.xml
    appcast_query_pairs: ec

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%.dmg'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Connect Fonts.app'
    requirement: identifier "com.extensis.SuitcaseFusion" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J6MMHGD9D6
