Comment: Written by MK 2025 02 21 - learning every day
Description: Packages the latest downloaded version of Connect Fonts
Identifier: com.github.markkenny.autopkg.pkg.ConnectFonts
ParentRecipe: com.github.markkenny.autopkg.download.ConnectFonts
MinimumVersion: "2.3"

Input:
  NAME: Connect Fonts

Process:
  - Processor: AppPkgCreator

  - Processor: DeprecationWarning
    Arguments:
      warning: Connect Fonts is the old name is no longer released. This recipe is deprecated and will be removed in the future.
