Comment: Written by MK 2024 12 09 - learning every day
Description: Packages the latest downloaded version of Connect Fonts
Identifier: com.github.markkenny.autopkg.pkg.Connectfonts
ParentRecipe: com.github.markkenny.autopkg.download.Connectfonts
MinimumVersion: "2.3"

Input:
  NAME: Connect Fonts

Process:
- Processor: AppPkgCreator
