Comment: Written by MK 2024 12 09 - learning every day
Description: Packages the latest downloaded version of Extensis Connect. (Formally Connect Fonts).
Identifier: com.github.markkenny.autopkg.pkg.ExtensisConnect
ParentRecipe: com.github.markkenny.autopkg.download.ExtensisConnect
MinimumVersion: "2.3"

Input:
  NAME: Extensis Connect

Process:
  - Processor: AppPkgCreator

  - Processor: DeprecationWarning
    Arguments:
      warning: Extensis Connect is the old name is no longer released. This recipe is deprecated and will be removed in the future.
