Description: Packages the latest release of calibrate PROFILER
Identifier: com.github.markkenny.autopkg.pkg.calibriteprofiler
ParentRecipe: com.github.markkenny.autopkg.download.calibriteprofiler

MinimumVersion: "2.3"

Input:
  NAME: CalibritePROFILER

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%pathname%/calibrite PROFILER.app'


