Description: Downloads the latest version of Topaz Gigapixel and creates a package.
Identifier: com.github.markkenny.autopkg.pkg.topaz-gigapixel
ParentRecipe: com.github.markkenny.autopkg.download.topaz-gigapixel
MinimumVersion: "2.3"

Input:
  NAME: Topaz Gigapixel

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/downloads/unpack'
    flat_pkg_path: '%pathname%'

- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/downloads/unpack/Topaz*.pkg'

- Processor: PackageInfoVersioner
  Arguments:
    package_info_path: '%found_filename%/PackageInfo'

- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%_%version%.pkg'
    source_pkg: '%pathname%'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/downloads/unpack'
