Comment: Created by MK 20241111
Description: Downloads the latest version of Topaz Video AI
Identifier: com.github.markkenny.autopkg.download.topaz-video-ai
MinimumVersion: 2.7.3

Input:
  NAME: Topaz Video AI

Process:
- Processor: URLDownloader
  Arguments:
    url: https://topazlabs.com/d/tvai/latest/mac/full
    prefetch_filename: true

- Processor: EndOfCheckPhase
