Comment: Created by MK 2024 02 14 - New downl,oad link
Description: Downloads the latest version of Topaz GigaPixel.
Identifier: com.github.markkenny.autopkg.download.topaz-gigapixel
MinimumVersion: "2.3"

Input:
  NAME: Topaz Gigapixel

Process:
- Processor: URLDownloader
  Arguments:
    url: "https://topazlabs.com/d/gigapixel/latest/mac/full"
    prefetch_filename: true

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: "%pathname%"
    expected_authority_names:
      - "Developer ID Installer: Topaz Labs, LLC (3G3JE37ZHF)"
      - "Developer ID Certification Authority"
      - "Apple Root CA"