Comment: Created by MK 20241111
Description: Packages the latest version of Topaz Video AI
Identifier: com.github.markkenny.autopkg.pkg.topaz-video-ai
ParentRecipe: com.github.markkenny.autopkg.download.topaz-video-ai
MinimumVersion: "2.7.3"

Input:
  NAME: Topaz Video AI

