Description: Downloads the latest version of Topaz DeNoise and creates a package.
Identifier: com.github.markkenny.autopkg.pkg.topaz-denoise
ParentRecipe: com.github.markkenny.autopkg.download.topaz-denoise
MinimumVersion: "2.3"

Input:
  NAME: Topaz DeNoise

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%pathname%/Topaz DeNoise AI.app'
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
