Comment: Created by MK 2023 12 19
Description: Downloads the latest version of Topaz Photo AI.
Identifier: com.github.markkenny.autopkg.download.topaz-photo-ai
MinimumVersion: "2.3"

Input:
  NAME: Topaz Photo AI
Process:
- Processor: URLDownloader
  Arguments:
    url: "https://topazlabs.com/d/photo/latest/mac/full"
    prefetch_filename: true

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: "%pathname%"
    expected_authority_names:
      - "Developer ID Installer: Topaz Labs, LLC (3G3JE37ZHF)"
      - "Developer ID Certification Authority"
      - "Apple Root CA"