Comment: Created by MK 2024 11 11
Description: Packages the latest version of Topaz Video AI
Identifier: com.github.markkenny.autopkg.pkg.topaz-video-ai
ParentRecipe: com.github.markkenny.autopkg.download.topaz-video-ai
MinimumVersion: 2.3

Input:
  NAME: Topaz Video AI

  