Description: Downloads the latest Monotype Fonts. MK 2024 04 24
Identifier: com.github.markkenny.autopkg.download.monotypefonts
MinimumVersion: "2.3"

Input:
  NAME: Monotype Fonts
  SEARCH_URL: https://support.monotype.com/en/articles/7859096-syncing-and-installing-fonts-with-monotype-app
  SEARCH_PATTERN: https://monotypeapp.monotype.com/release/\d+/mac/MTFInstaller.zip

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: "%SEARCH_PATTERN%"
      url: "%SEARCH_URL%"

  - Processor: URLDownloader
    Arguments:
      url: "%match%"
      filename: "MTFInstaller.zip"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/unzip/MTFInstaller.pkg"
      expected_authority_names:
        - "Developer ID Installer: Monotype Imaging (9TY7K37N87)"
        - Developer ID Certification Authority
        - Apple Root CA

  - Processor: Unarchiver
    Arguments:
        archive_path: "%pathname%"
        destination_path: "%RECIPE_CACHE_DIR%/unzip"
        purge_destination: true
        archive_format: zip
