Description: Packages the current release version of Monotype Fonts
Identifier: com.github.markkenny.autopkg.pkg.monotypefonts
MinimumVersion: "2.3"

ParentRecipe: com.github.markkenny.autopkg.download.monotypefonts

Input:
  NAME: Monotype Fonts

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpkg"
      flat_pkg_path: "%RECIPE_CACHE_DIR%/unzip/MTFInstaller.pkg"
      purge_destination: false

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpkg2"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpkg/DTAppInstaller.pkg/Payload"
      purge_destination: false

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/unpkg2/Monotype Fonts/Application/Monotype Fonts.app/Contents/Info.plist"
      plist_version_key: "CFBundleShortVersionString"

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      source_pkg: "%pathname%"
