Description: Packages both ARM and INTEL versions of Monotype Fonts (Universal)
Identifier: com.github.markkenny.autopkg.pkg.monotypefonts-universal
ParentRecipe: com.github.markkenny.autopkg.download.monotypefonts-universal

MinimumVersion: "2.3"

Input:
  NAME: Monotype Fonts

Process:
  # Extract version from ARM package
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/unpacked'
      flat_pkg_path: '%RECIPE_CACHE_DIR%/unzip_arm/MTFInstaller.pkg'
      purge_destination: true

  # Escape spaces in Distribution file URL
  - Processor: com.github.homebysix.FindAndReplace/FindAndReplace
    Arguments:
      find: ' '
      input_string: 'file://localhost/%RECIPE_CACHE_DIR%/unpacked/Distribution'
      replace: '%20'

  # Extract version from Distribution XML
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '<title>Monotype Fonts (\d+\.\d+\.\d+) \([^\)]+\)</title>'
      result_output_var_name: version
      url: '%output_string%'

  # Create directory structure
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/Universal/pkgroot"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/Universal/scripts"

  # Copy both architecture packages
  - Processor: Copier
    Arguments:
      overwrite: false
      source_path: '%RECIPE_CACHE_DIR%/unzip_arm/MTFInstaller.pkg'
      destination_path: "%RECIPE_CACHE_DIR%/Universal/scripts/%NAME%-ARM-%version%.pkg"

  - Processor: Copier
    Arguments:
      overwrite: false
      source_path: '%RECIPE_CACHE_DIR%/unzip_intel/MTFInstaller.pkg'
      destination_path: "%RECIPE_CACHE_DIR%/Universal/scripts/%NAME%-INTEL-%version%.pkg"

  # Create preinstall script for architecture detection
  - Processor: FileCreator
    Arguments:
      file_content: |
        #!/bin/bash

        # Determine working directory
        installDir=$(dirname $0)

        # Identify installer package names
        Intel_package="%NAME%-INTEL-%version%.pkg"
        Apple_Silicon_package="%NAME%-ARM-%version%.pkg"

        # Determine if this Mac has an Intel or Apple Silicon processor
        processor=$( /usr/bin/arch | grep -o "arm64")
        if [[ -n "$processor" ]]; then
          /usr/sbin/installer -pkg "$Apple_Silicon_package" -target "$3"
        else
          /usr/sbin/installer -pkg "$Intel_package" -target "$3"
        fi

        exit 0
      file_mode: "0755"
      file_path: "%RECIPE_CACHE_DIR%/Universal/scripts/preinstall"

  # Create universal wrapper package
  - Processor: PkgCreator
    Arguments:
      pkg_request:
        id: com.monotype.fonts-universal
        pkgname: "%NAME%-Universal-%version%"
        scripts: "%RECIPE_CACHE_DIR%/Universal/scripts"
        version: "%version%"

  # Cleanup
  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpacked'
        - '%RECIPE_CACHE_DIR%/Universal'
        - '%RECIPE_CACHE_DIR%/unzip_intel'
        - '%RECIPE_CACHE_DIR%/unzip_arm'


        