Description: Packages both ARM and INTEL versions of Monotype Fonts (Universal)
Identifier: com.github.markkenny.autopkg.pkg.monotypefonts-universal
ParentRecipe: com.github.markkenny.autopkg.download.monotypefonts-universal

MinimumVersion: "2.3"

Input:
  NAME: Monotype Fonts

Process:
  # Unpack ARM installer to extract version
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/unpacked_arm'
      flat_pkg_path: '%RECIPE_CACHE_DIR%/unzip_arm/MTFInstaller.pkg'
      purge_destination: true

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/unpacked_arm_payload'
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpacked_arm/DTAppInstaller.pkg/Payload'
      purge_destination: false

  # Extract version from Info.plist
  - Processor: Versioner
    Arguments:
      input_plist_path: '%RECIPE_CACHE_DIR%/unpacked_arm_payload/Monotype Fonts/Application/Monotype Fonts.app/Contents/Info.plist'
      plist_version_key: "CFBundleShortVersionString"

  # Create directory structure
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        scripts: "0755"
        root: "0755"
        root/private: "0755"
        root/private/tmp: "0777"
      pkgroot: "%RECIPE_CACHE_DIR%/universal"

  # Copy both architecture packages to tmp
  - Processor: FileMover
    Arguments:
      overwrite: false
      source: '%RECIPE_CACHE_DIR%/unzip_arm/MTFInstaller.pkg'
      target: "%RECIPE_CACHE_DIR%/universal/root/private/tmp/%NAME%-ARM-%version%.pkg"

  - Processor: FileMover
    Arguments:
      overwrite: false
      source: '%RECIPE_CACHE_DIR%/unzip_intel/MTFInstaller.pkg'
      target: "%RECIPE_CACHE_DIR%/universal/root/private/tmp/%NAME%-INTEL-%version%.pkg"

  # Create postinstall script for architecture detection
  - Processor: FileCreator
    Arguments:
      file_content: |
        #!/bin/zsh

        # Set variables
        declare -r INTEL="$3/private/tmp/%NAME%-INTEL-%version%.pkg"
        declare -r APPLE_SILICON="$3/private/tmp/%NAME%-ARM-%version%.pkg"

        # Determine architecture
        ARCH=$(/usr/bin/arch)

        # Install corresponding package
        if [[ "${ARCH}" == i386 ]]
        then
            /usr/sbin/installer -pkg "${INTEL}" -target "$3"
            EXIT_CODE=$?
        else
            /usr/sbin/installer -pkg "${APPLE_SILICON}" -target "$3"
            EXIT_CODE=$?
        fi

        echo "Cleaning up..."
        /bin/rm -rf "${INTEL}" "${APPLE_SILICON}"

        # Check exit code and bail if the package didn't install correctly
        if [[ "${EXIT_CODE}" -ne 0 ]]
        then
            echo "Something went wrong during package installation. Please check install.log and try again. Bailing..."
            exit 1
        fi

        exit 0
      file_mode: "0755"
      file_path: "%RECIPE_CACHE_DIR%/universal/scripts/postinstall"

  # Create universal wrapper package
  - Processor: PkgCreator
    Arguments:
      pkg_request:
        id: com.monotype.fonts-universal
        pkgname: "%NAME%-Universal-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/universal/root"
        scripts: "%RECIPE_CACHE_DIR%/universal/scripts"
        version: "%version%"

  # Cleanup
  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpacked_arm'
        - '%RECIPE_CACHE_DIR%/unpacked_arm_payload'
        - '%RECIPE_CACHE_DIR%/universal'
        - '%RECIPE_CACHE_DIR%/unzip_intel'
        - '%RECIPE_CACHE_DIR%/unzip_arm'
