Comment: Created by MK 2023 02 13
Description: Downloads the latest version of Hive.
Identifier: com.github.markkenny.autopkg.download.Hive
MinimumVersion: "2.3"

Input:
  NAME: Hive

Process:
  - Processor: URLDownloader
    Arguments:
      url: "%DOWNLOAD_URL%"
      filename: "%NAME%.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Monotype Connect.app"
      requirement: "identifier \"com.extensis.connect\" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J6MMHGD9D6"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%pathname%/Monotype Connect.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString