Comment: Created by MK 2024 11 26 Struggling
Description: Downloads the latest Frame IO
Identifier: com.github.markkenny.autopkg.download.frameiotransfer
MinimumVersion: '2.3'

Input:
  NAME: FrameIO Transfer

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: 'href="(https://transferapp\.frame\.io/Frame\.io-Transfer/[a-f0-9]+/latest/darwin/x64/Frame\.io\+Transfer\.dmg)"'
    url: 'https://frame.io/transfer'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: '%match%'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Frame.io Transfer.app'
    requirement: identifier "com.frameio.transfer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6D429SHX3Y"

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/Frame.io Transfer.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
