Comment: Created by MK 2023 08 14
Description: Downloads and packages the latest Frame IO
Identifier: com.github.markkenny.autopkg.pkg.frameiotransfer
ParentRecipe: com.github.markkenny.autopkg.download.frameiotransfer
MinimumVersion: "2.3"

Input:
  NAME: Frame IO Transfer

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%pathname%/Frame.io Transfer.app'
