Comment: Created by MK 2025 02 28
Description: Downloads the latest version of Greyscale Gorilla and creates a package.
Identifier: com.github.markkenny.autopkg.pkg.greyscalegorilla
ParentRecipe: com.github.markkenny.autopkg.download.greyscalegorilla
MinimumVersion: "2.3"

Input:
  NAME: Grayscale Gorilla

Process:
- Processor: AppPkgCreator
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
