Description: Downloads the latest Greyscale Gorilla 2025 02 28
Identifier: com.github.markkenny.autopkg.download.greyscalegorilla

MinimumVersion: "2.3"

Input:
  NAME: Greyscale Gorilla

Process:

- Processor: URLTextSearcher
  Arguments:
    url: 'https://greyscalegorilla.com/studio-download/'
    re_pattern: 'https:\/\/greyscalegorilla\.com\/large-download\/\?path=Studio\/Greyscalegorilla\.Studio_[^\/]+_universal\.dmg'
    result_output_var_name: DOWNLOAD_URL

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase

- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/Greyscalegorilla Studio.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Greyscalegorilla Studio+.app'
    requirement: identifier "com.greyscalegorilla.studio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = KF48V9DW9Z

